import random
a=[[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
   [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],]
for i in range(0,20):
    for j in range(0,20):
        a[i][j]= random.randint(0,1)
    
i=0 
j=0
while j==0:
    x=int(input("enter a number for x:"))
    y=int(input("enter a number for y:"))

    #گوشه بالا سمت چپ
    if (a[x==1][y==1]):
        print(a[i==2][j==1],end="")
        print(a[i==1][j==2],end="")
        print(a[i==2][j==2],end="")
    
    #گوشه بالا سمت راست
    elif (a[x==1][y==20]):
        print(a[i==1][j==19],end="")
        print(a[i==2][j==19],end="")
        print(a[i==2][j==20],end="")
    
    #گوشه پایین سمت چپ
    elif (a[x==20][y==1]):
        print(a[i==19][j==1],end="")
        print(a[i==19][j==2],end="")
        print(a[i==20][j==2],end="")
    
    #گوشه پایین سمت راست
    elif (a[x==20][y==20]):
        print(a[i==20][j==19],end="")
        print(a[i==19][j==19],end="")
        print(a[i==19][j==20],end="")
    
    #وسط بالا
    elif (a[x==1][y==range(2,19)]):
        print(a[i==1][j==y-1],end="")
        print(a[i==1][j==y+1],end="")
        print(a[i==2][j==y-1],end="")
        print(a[i==2][j==y],end="")
        print(a[i==2][j==y+1],end="")
    
    #وسط چپ
    elif (a[x==range(2,19)][y==1]):
        print(a[i==x-1][j==1],end="")
        print(a[i==x+1][j==1],end="")
        print(a[i==x-1][j==2],end="")
        print(a[i==x][j==2],end="")
        print(a[i==x+1][j==2],end="")
    
    #وسط راست
    elif (a[x==range(2,19)][y==20]):
        print(a[i==x-1][j==20],end="")
        print(a[i==x+1][j==20],end="")
        print(a[i==x-1][j==19],end="")
        print(a[i==x][j==19],end="")
        print(a[i==x+1][j==19],end="")
    
    #وسط پایین
    elif (a[x==20][y==range(2,19)]):
        print(a[i==20][j==y-1],end="")
        print(a[i==20][j==y+1],end="")
        print(a[i==19][j==y-1],end="")
        print(a[i==19][j==y],end="")
        print(a[i==19][j==y+1],end="")
    
    #همه وسط ها
    elif (a[x==range(2,19)][y==range(2,19)]):
        print(a[i==x-1][j==y-1],end="")
        print(a[i==x-1][j==y],end="")
        print(a[i==x-1][j==y+1],end="")
        print(a[i==x][j==y-1],end="")
        print(a[i==x][j==y+1],end="")
        print(a[i==x+1][j==y-1],end="")
        print(a[i==x+1][j==y],end="")
        print(a[i==x+1][j==y+1],end="")    
    
    if a[x][y]==1:  
        i=i+1
    else:
        break
print("game over")
print("your score:",i)

    
